@raw_text = "Дом Наркомфина — один из знаковых памятников архитектуры советского авангарда и конструктивизма. Построен в 1928—1930 годах по проекту архитекторов Моисея Гинзбурга, Игнатия Милиниса и инженера Сергея Прохорова для работников Народного комиссариата финансов СССР (Наркомфина). Автор замысла дома Наркомфина Гинзбург определял его как «опытный дом переходного типа». Дом находится в Москве по адресу: Новинский бульвар, дом 25, корпус 1. С начала 1990-х годов дом находился в аварийном состоянии, был трижды включён в список «100 главных зданий мира, которым грозит уничтожение». В 2017—2020 годах отреставрирован по проекту АБ «Гинзбург Архитектс», функционирует как элитный жилой дом. Отдельно стоящий «Коммунальный блок» (историческое название) планируется как место проведения публичных мероприятий."
@companies = [
  "Yandex", "VK", "Mail.Ru Group", "Kaspersky Lab", "Avito",
  "Tinkoff Bank", "Sberbank Technology", "ABBYY", "1C Company", "Rambler",
  "Gazprom Neft", "Luxoft", "EPAM Systems", "Rozum Robotics",
  "Game Insight", "Nival", "JetBrains", "Qiwi", "Parallels", "Skolkovo Foundation",
  "Alawar Entertainment", "Acronis", "Crello", "Auriga", "IT Territory",
  "Playrix", "Ivideon", "Reksoft", "Artezio", "Axmor Software",
  "SimbirSoft", "iSpring Solutions", "Badoo", "G5 Entertainment", "Herocraft",
  "ZYTOV Design Studio", "Art. Lebedev Studio", "Redmadrobot", "FIRMA Agency", "Heads and Hands", "HSE ART AND DESIGN", "ГК Самолет"
]
@cities = [
  "Москва",
  "Санкт-Петербург",
  "Новосибирск",
  "Екатеринбург",
  "Нижний Новгород",
  "Казань",
  "Челябинск",
  "Омск",
  "Самара",
  "Ростов-на-Дону"
]
@requirements = [
  "Высшее образование в области дизайна или искусства;\r\n Опыт работы в дизайне пользовательских интерфейсов от 2 лет;\r\n",
  "Знание инструментов для прототипирования и графического дизайна (например, Sketch, Adobe Photoshop);\r\n Понимание принципов создания удобного пользовательского интерфейса (UX);\r\n",
  "Навыки работы с векторной и растровой графикой;\r\n Умение работать в команде и взаимодействовать с разработчиками;\r\n",
  "Творческий подход и способность генерировать инновационные идеи;\r\n Знание английского языка на уровне не ниже Intermediate для чтения технической документации;\r\n",
  "Опыт работы с 3D-графикой и анимацией будет преимуществом;\r\n Способность к быстрому обучению и адаптации к изменяющимся требованиям проекта;\r\n",
  "Знание последних тенденций в области дизайна и технологий;\r\n Опыт работы в кросс-функциональных командах;\r\n",
  "Уверенное владение программами Adobe Creative Suite;\r\n Внимание к деталям и качеству выполнения работы;\r\n",
  "Способность работать в условиях сжатых сроков и меняющихся приоритетов;\r\n Навыки презентации и общения с клиентами;\r\n",
  "Понимание основ веб-разработки и программирования;\r\n Умение работать с пользовательскими исследованиями и аналитикой;\r\n",
  "Опыт руководства дизайнерскими проектами или командами будет являться преимуществом;\r\n Умение решать сложные дизайнерские задачи.\r\n"
]
@conditions = [
  "Конкурентоспособная заработная плата;\r\n Гибкий график работы;\r\n",
  "Возможность удаленной работы;\r\n Корпоративные мероприятия и обучение;\r\n",
  "Комфортабельный офис с современным оборудованием;\r\n Оплачиваемый отпуск и больничные;\r\n",
  "Дружественная и поддерживающая командная атмосфера;\r\n Опции корпоративных акций для сотрудников;\r\n",
  "Медицинская страховка включая стоматологию;\r\n Программы профессионального и карьерного роста;\r\n",
  "Оплата проезда и мобильной связи;\r\n Корпоративная библиотека и доступ к онлайн-курсам;\r\n",
  "Ежегодные бонусы в зависимости от результатов работы;\r\n Льготы на продукцию компании;\r\n",
  "Возможность участия в международных проектах и командировках;\r\n Дополнительные дни отпуска;\r\n",
  "Бесплатные обеды и напитки в офисе;\r\n Спортзал или компенсация занятий спортом;\r\n",
  "Организация корпоративных тренингов и семинаров для повышения квалификации;\r\n Социальный пакет и программы лояльности для сотрудников;\r\n"
]

@jobs = [
  "Специалист по дизайну цифровых музеев",
  "Дизайнер UX/UI",
  "Художник интерактивных медиа",
  "Графический дизайнер",
  "Веб-разработчик",
  "Художник анимации",
  "3D-моделлер",
  "Разработчик виртуальной реальности",
  "Арт-директор",
  "Креативный технолог",
  "Дизайнер моушн-графики",
  "Дизайнер корпоративной идентификации",
  "Иллюстратор",
  "Исследователь пользовательского опыта",
  "Дизайнер игр",
  "Мультимедийный художник",
  "Дизайнер экологической графики",
  "Стратег цифрового контента",
  "Дизайнер шрифтов",
  "Дизайнер упаковки",
  "Специалист по цифровой иллюстрации",
  "Дизайнер интерфейсов",
  "Разработчик программного обеспечения",
  "Художник концепт-арта",
  "Специалист по аудиовизуальным медиа",
  "Дизайнер мобильных приложений",
  "Дизайнер пользовательских интерфейсов",
  "Специалист по визуализации данных",
  "Художник по компьютерной графике",
  "Дизайнер виртуальных миров",
  "Специалист по информационной архитектуре",
  "Дизайнер звуковых эффектов",
  "Специалист по анимационной графике",
  "Дизайнер социальных медиа",
  "Креативный редактор",
  "Дизайнер взаимодействия",
  "Разработчик игр",
  "Специалист по цифровому маркетингу",
  "Дизайнер веб-интерфейсов",
  "Специалист по цифровому брендингу"
]
@descriptions = [
  "Создание концепций и дизайна новых музеев и выставок;\r\n Посещение музеев Москвы с целью выявления возможностей для добавления иммерсивных средств в экспозициях;\r\n Сопровождение процесса продаж цифровой техники (голограммы, интерактивные бинокли и др.);\r\n Подготовка презентаций, постов в социальных сетях;\r\n Подготовка писем для организаций и музеев.",
  "Разработка пользовательских интерфейсов для мобильных и веб-приложений;\r\n Проведение исследований пользовательского опыта;\r\n Сотрудничество с командой разработчиков и менеджерами проектов;\r\n Создание прототипов и проведение юзабилити-тестирования.",
  "Создание и реализация интерактивных медиа-проектов;\r\n Исследование новых технологий в области интерактивных медиа;\r\n Работа с командой дизайнеров и программистов;\r\n Организация и участие в выставках и медиа-фестивалях.",
  "Разработка концепций и макетов графического дизайна;\r\n Сотрудничество с отделом маркетинга и рекламы;\r\n Создание дизайна для печатной и цифровой рекламы;\r\n Работа с корпоративной стилистикой компании.",
  "Веб-разработка и поддержка сайтов;\r\n Оптимизация производительности и улучшение пользовательского интерфейса;\r\n Сотрудничество с командой дизайнеров и разработчиков;\r\n Тестирование и обновление веб-приложений.",
  "Создание и разработка 3D-моделей для игр, фильмов и анимации;\r\n Работа с программным обеспечением для 3D-моделирования;\r\n Взаимодействие с командой аниматоров и графических дизайнеров;\r\n Подготовка 3D-моделей для печати.",
  "Разработка проектов виртуальной и дополненной реальности;\r\n Исследование и внедрение новых технологий в области VR и AR;\r\n Сотрудничество с командой программистов и дизайнеров;\r\n Создание интерактивных VR/AR-приложений.",
  "Руководство художественной командой;\r\n Разработка креативных концепций;\r\n Организация и контроль художественного процесса;\r\n Взаимодействие с клиентами и партнерами.",
  "Разработка и реализация технологических решений в области креативных проектов;\r\n Исследование новых технологий и инноваций;\r\n Работа в тесном сотрудничестве с командами дизайнеров и разработчиков;\r\n Внедрение новых технологий в креативные проекты."
]
@descriptions = [
  "Создание концепций и дизайна новых музеев и выставок;\r\n Посещение музеев Москвы с целью выявления возможностей для добавления иммерсивных средств в экспозициях;\r\n Сопровождение процесса продаж цифровой техники (голограммы, интерактивные бинокли и др.);\r\n Подготовка презентаций, постов в социальных сетях;\r\n Подготовка писем для организаций и музеев.",
  "Разработка пользовательских интерфейсов для мобильных и веб-приложений;\r\n Проведение исследований пользовательского опыта;\r\n Сотрудничество с командой разработчиков и менеджерами проектов;\r\n Создание прототипов и проведение юзабилити-тестирования.",
  "Создание и реализация интерактивных медиа-проектов;\r\n Исследование новых технологий в области интерактивных медиа;\r\n Работа с командой дизайнеров и программистов;\r\n Организация и участие в выставках и медиа-фестивалях.",
  "Разработка концепций и макетов графического дизайна;\r\n Сотрудничество с отделом маркетинга и рекламы;\r\n Создание дизайна для печатной и цифровой рекламы;\r\n Работа с корпоративной стилистикой компании.",
  "Веб-разработка и поддержка сайтов;\r\n Оптимизация производительности и улучшение пользовательского интерфейса;\r\n Сотрудничество с командой дизайнеров и разработчиков;\r\n Тестирование и обновление веб-приложений.",
  "Создание и разработка 3D-моделей для игр, фильмов и анимации;\r\n Работа с программным обеспечением для 3D-моделирования;\r\n Взаимодействие с командой аниматоров и графических дизайнеров;\r\n Подготовка 3D-моделей для печати.",
  "Разработка проектов виртуальной и дополненной реальности;\r\n Исследование и внедрение новых технологий в области VR и AR;\r\n Сотрудничество с командой программистов и дизайнеров;\r\n Создание интерактивных VR/AR-приложений.",
  "Руководство художественной командой;\r\n Разработка креативных концепций;\r\n Организация и контроль художественного процесса;\r\n Взаимодействие с клиентами и партнерами.",
  "Разработка и реализация технологических решений в области креативных проектов;\r\n Исследование новых технологий и инноваций;\r\n Работа в тесном сотрудничестве с командами дизайнеров и разработчиков;\r\n Внедрение новых технологий в креативные проекты."
]
@words = @raw_text.downcase.gsub(/[—.—,«»:()]/, '').gsub(/  /, ' ').split(' ')
def seed
    reset_db
    create_admin
    create_users
    fill_profiles
    create_posts(2, 8)
    create_vacancies(100)
  end
def reset_db
    Rake::Task['db:drop'].invoke
    Rake::Task['db:create'].invoke
    Rake::Task['db:migrate'].invoke
end
def create_sentence(x, y)
    sentence_words = []
    (x..y).to_a.sample.times do
        sentence_words << @words.sample
      end
      sentence = sentence_words.join(' ').capitalize + '.'
end
def upload_random_image
  uploader = PostImageUploader.new(Post.new, :pic)
  uploader.cache!(File.open(Dir.glob(File.join(Rails.root, 'public/autoupload/posts', '*')).sample))
  uploader
end
def upload_random_image
  uploader = PostImageUploader.new(Profile.new, :profile_pic)
  uploader.cache!(File.open(Dir.glob(File.join(Rails.root, 'public/autoupload/posts', '*')).sample))
  uploader
end
def fill_profiles
  User.all.each do |user|
    profile = user.profile
    profile.update(description: create_sentence(1, 3), nick_name: create_sentence(1, 2), profile_pic: upload_random_image)
    puts "Profile with id #{profile.id} associated with user id #{user.id}"
  end
end
def create_admin
    user_data = {
        email: "admin@email.com",
        password: 'testtest',
        admin: "true"
      }
  
      user = User.create!(user_data)
      puts "Admin created with id #{user.id}"
end
def create_users
    i = 0
  
    10.times do
      user_data = {
        email: "user_#{i}@email.com",
        password: 'testtest'
      }
  
      user = User.create!(user_data)
      puts "User created with id #{user.id}"
  
      i += 1
    end
  end
def create_posts(x, y)
    user = User.all.sample
    Profile.all.each do |profile|
      (x..y).to_a.sample.times do
          post = Post.create(profile_id: profile.id, description: create_sentence(2, 5), post_title: create_sentence(1, 1), pic: upload_random_image,user_id: user.id)
          puts "Post with id #{post.id} associated with profile id #{post.profile.id}"
      end
    end
end
def create_vacancies(quantity)
  quantity.times do |x|
    x = EmploymentOpportunity.create(
      title: @jobs.sample,
      vacancy_type: ["part-time", "intern", "full-time"].sample,
      user_id: User.all.sample.id,
      status: ["open", "closed"].sample,
      application_deadline: Date.today + rand(30).days,
      description: @descriptions.sample,
      location: @cities.sample,
      conditions: @conditions.sample,
      requirements: @requirements.sample,
      company_name: @companies.sample,
      work_environment: ["офис или удалённо", "офис", "удалённо"].sample,
      salary: ["От 120 000", "60 000–80 000", "100 000", "52 000", "280 000"].sample)
      puts "Employment opportunity with id #{x.id} has been created"
  end
end
def create_post_replies(x, y)
    (x..y).to_a.sample.times do
      user = User.all.sample
      post = Post.all.sample
      reply = post.replies.create(profile_id: post.profile_id, user_id: user.id, description: create_sentence(2, 5))
      puts "Post reply with id #{reply.id} associated with post id #{post.id}"
    end
    # Profile.all.each do |profile|
    # (x..y).to_a.sample.times do
    #     post = Post.create(profile_id: profile.id, description: create_sentence(2, 5), post_title: create_sentence(1, 1), pic: upload_random_image,user_id: user.id)
    #     puts "Post with id #{post.id} associated with profile id #{post.profile.id}"
    # end
end
seed